static2/coarse/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    jetInlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    jetOutlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }
    airInlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    airOutlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
    fastWalls
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    axis
    {
        type            empty;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
}


// ************************************************************************* //
